package com.example.grafik.logic

import androidx.compose.ui.unit.Dp
import androidx.compose.ui.unit.dp

//all values are named as the definitions, but simplified, yet still providing sense
val russianConstants: Constants = Constants(
    "Удалить последнюю запись",
    "Подтвердить",
    "Заполните все пункты",
    " (поле ввода числа)",
    "Информация о дне",
    "График калорий",
    "График повторений",
    "График веса",
    "Добавить картинку",
    "кг",
    "раз",
    "ккал",
    "Список пуст",
    "Такого пункта нет",
    "Поиск окончен. Нажмите на кнопку поиска для показа всех категорий",
    "Выберите хотя-бы один график",
    "Введите название (до $nameSize символов)",
    "Заполните название категории",
    "Такое название уже есть",
    "Добавить",
    120.dp,
    100.dp,
    "элемент графика?",
    "категорию?",
    "Вы точно хотите удалить",
    "Да",
    "Нет",
    "Список пуст",
    "Слишком длинное название",
    "null",
    "Максимум",
    "Минимум",
    "Введите текст для поиска",
    "yyyyMMdd_HHmmss",
    3,
    0
)